In [1]:
import pandas as pd

In [26]:
# intro to OOP with objects and references
df = pd.DataFrame( [[1,2,3] , [4,5,6] , [7,8,9]] , columns = ["A","B","C"])
df

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [27]:
df_new = df                       # Making new df with same data
df_new

   A  B  C
0  1  2  3
1  4  5  6
2  7  8  9

In [28]:
df_new.loc[0,"A"] = 100           # Changing one thing in new df
df_new

     A  B  C
0  100  2  3
1    4  5  6
2    7  8  9

In [29]:
df                                # Old df changes even though no change was made to it

     A  B  C
0  100  2  3
1    4  5  6
2    7  8  9

In [24]:
#################################################################################

In [30]:
data = {
    "Names":("John","David","Chris") , "Math":(89,90,91) , "Phy":(92,92,94) , "Chem":(69,88,93)
         }
marks = pd.DataFrame(data)
marks

   Names  Math  Phy  Chem
0   John    89   92    69
1  David    90   92    88
2  Chris    91   94    93

In [31]:
marks_1 = marks.copy()
marks_1

   Names  Math  Phy  Chem
0   John    89   92    69
1  David    90   92    88
2  Chris    91   94    93

In [33]:
marks_1.loc[1,"Math"] = 1000      # Changing something in new df
marks_1

   Names  Math  Phy  Chem
0   John    89   92    69
1  David  1000   92    88
2  Chris    91   94    93

In [34]:
marks                             # But the old one is still the same

   Names  Math  Phy  Chem
0   John    89   92    69
1  David    90   92    88
2  Chris    91   94    93